// ナオミ
var boss_map = Array(
	// エリアボス
	[2220000, 104000400],
	[3220000, 101030404],
	[5220001, 110040000],
	[7220000, 250010304],
	[8220000, 200010300],
	[7220002, 250010503],
	[7220001, 222010310],
	[6220000, 107000300],
	[5220002, 100040105],
	[5220003, 220050100],
	[6220001, 221040301],
	[8220003, 240040401],
	[3220001, 260010201],
	[8220002, 261030000],
	[4220000, 230020100],
	// 通常ボス
	[9600010, 701010324], // 大王ムカデ
	[6130101, 100000005], // ママシュ
	[6300005, 105070002], // ゾンビママシュ
	[8130100, 105090900], // ジュニアバルログ
	[9410014, 741020101], // 屋台 reset
	[9400205, 800010100], // パパシュ
	//[9300094, 921100300], // レッサーバルログ?
	[9400549, 803000200], // ヘッドネスホースマン
	[9400575, 803000201], // ビッグフット
	[9400594, 803000500], // マスターガーディアン
	[8180001, 240020101], // グリフォン
	[8180000, 240020401], // レッドドラゴン
	[8510000, 230040420], // ワルメンボウ
	[8520000, 230040420], // ワルメンボウ
	[9400014, 800020130], // 天狗
	[9400405, 800040208], // 甲冑武者
	[9400596, 803000400], // スカーレットフェニックス
	[9400597, 803000400], // アズールオセロット
	[8220004, 270010500], // ドド
	[8220005, 270020500], // リーリノフ
	[8220006, 270030500], // ライカ
	[9400121, 801040003], // 姐御
	[9600021, 702070400], // 黄金巨人
	[9400408, 800040410], // 殿様
	// todo PQ
	// スーパースライム
	// ジェラシーロッカー
	// 大臣キノコ
	// モーメガバン
	// パパフィクシ
	// ポイズンゴーレム
	// デイビーゾーン
	// フランケンロイド
	// ネクロマンサー
	// ニーベルング
	// 名もなき魔獣
	[8300006, 240080600], // ドラゴニカ reset, PQ
	[9400293, 802000711], // デュナス reset, PQ
	[9400295, 802000711], // デュナス reset, PQ
	[9400288, 802000801], // ロイヤルガード reset, PQ
	[9400296, 802000803], // コアブレイズ reset, PQ
	[9400376, 802000821], // アウフヘーベン reset, PQ
	// 特殊ボス
	// BG
	// ビシャス
	// 武林妖僧
	// 武公パンダ
	[4300013, 103040430], // ジェラシーロッカー, reset
	[6130101, 100000005]
);


function EnterBossMap(mapid) {
	var reset = (cm.getPlayerCount(mapid) == 0) ? true : false;
	if (reset) {
		cm.resetMap(mapid);
	}
	cm.warp(mapid, "sp");
}

var status = -1;
function action(mode, type, selection) {
	if (mode != 1) {
		cm.dispose();
		return;
	}

	status++;

	switch (status) {
		// 選択画面
		case 0:
			{
				text = "ボスモンスターテスト\r\n";
				for (var i = 0; i < boss_map.length; i++) {
					if (i < 15) {
						text += "#L" + i + "##r#o" + boss_map[i][0] + "# (#m" + boss_map[i][1] + "#)#l#k\r\n";
					}
					else {
						text += "#L" + i + "##b#o" + boss_map[i][0] + "# (#m" + boss_map[i][1] + "#)#l#k\r\n";
					}
				}

				cm.sendSimple(text);
			}
			return;
		case 1:
			EnterBossMap(boss_map[selection][1]);
			break;
		default:
			break;
	}
	return cm.dispose();
}