// 時間の神殿

var time_quest_portal = Array(
	// 思い出の道
	[270010100, 270010110, "out00", 3501],
	[270010200, 270010210, "out00", 3502],
	[270010300, 270010310, "out00", 3503],
	[270010400, 270010410, "out00", 3504],
	[270010500, 270020000, "out00", 3507],
	// 後悔の道
	[270020100, 270020110, "out00", 3508],
	[270020200, 270020210, "out00", 3509],
	[270020300, 270020310, "out00", 3510],
	[270020400, 270020410, "out00", 3511],
	[270020500, 270030000, "out00", 3514],
	// 忘却の道
	[270030100, 270030110, "out00", 3515],
	[270030200, 270030210, "out00", 3516],
	[270030300, 270030310, "out00", 3517],
	[270030400, 270030410, "out00", 3518],
	[270030500, 270040000, "out00", 3521],
	// ピンクビーン
	[270040000, 270040100, "out00", 0]
);

function enter(pi) {
	var mapid = pi.getMapId();
	for (var i = 0; i < time_quest_portal.length; i++) {
		if (mapid == time_quest_portal[i][0]) {
			// デバッグ用
			if (!pi.haveItem(4032002)) {
				pi.gainItem(4032002, 1);
			}
			// 前提クエストチェック処理
			// pi.getQuestStatus(time_quest_portal[i][3]) == 2
			pi.playPortalSE();
			pi.warp(time_quest_portal[i][1], time_quest_portal[i][2]);
			return true;
			// 本来ならこの辺に前提クエスト完了していない場合は前のマップへ転送する処理
		}
	}

	return false;
}